# Part 1

The file "Purchase_Data.csv" contains purchase data at a Chinese supermarket for various products.  Read this csv into a dataframe called df_data and use the head() method to check that you have read in the data correctly. Make sure you import pandas.

In [1]:
#Write your code here
import pandas as pd
df=pd.read_csv("Purchase_Data.csv",header=0)
df.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0

Use the dtypes attribute to view how each column is stored

In [6]:
#Write your code here
df.columns

Index(['invoice_number', 'invoice_time', 'store_id', 'product_id',
       'category_id', 'num_item', 'price'],
      dtype='object')

Slice the first two columns using .loc and store the result in a variable called result_1.

In [ ]:
#Write you code here
result_1= df.loc[0:2, "invoice_number":"invoice_time"]
result_1

   invoice_number   invoice_time
0    2.020000e+11  7/15/15 10:45
1    2.020000e+11  7/15/15 12:16
2    2.020000e+11  7/15/15 12:16

Slice the first two rows using .loc and store the result in a variable called result_2.

In [9]:
#Write you code here
result_2= df.loc[0:2]
result_2

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0

Slice the first four rows and the first five columns and store the result in a variable called result_3.

In [10]:
#Write your code here
result_3=df.loc[0:3, "invoice_number":"category_id"]
result_3

   invoice_number   invoice_time store_id  product_id  category_id
0    2.020000e+11  7/15/15 10:45     G816     7000300       210101
1    2.020000e+11  7/15/15 12:16     G816     7070884        70203
2    2.020000e+11  7/15/15 12:16     G816     7070884        70203
3    2.020000e+11  7/15/15 12:16     G816     7070891        70401

Slice rows 0,4,6 and columns invoice time and price and store the result in variable called result_4.

In [12]:
#Write your code here
result_4= df.loc[[0,4,6],["invoice_time","price","store_id"]]
result_4

    invoice_time  price store_id
0  7/15/15 10:45    2.0     G816
4  7/15/15 12:16    6.0     G816
6  7/15/15 15:28    2.0     G816

Store the number rows in a variable called num_rows.

In [13]:
num_rows = df.shape[0]
print(f"Number of rows:{num_rows}")

Number of rows:5382

Print out the last row of the data to dataframe. **Hint:** use the variable num_rows from the previous exercise.

In [18]:
#Write your code here
last_row = df.iloc[-1,:]
last_row

invoice_number    202000000000.0
invoice_time        9/5/15 23:38
store_id                    G619
product_id              23030206
category_id               210101
num_item                     1.0
price                        2.0
Name: 5381, dtype: object

# Part 2

Compute the average and max price charged.  Store the results in variables called avg_price and max_price

In [22]:
#Write your code here
avg_price = df.price.mean()
max_price = df.price.max()
avg_price,max_price

(np.float64(3.1920522110741363), np.float64(6.01))

Compute the average price and average number of items purchased with only a single call to the mean() method. Store these averages in avg_price and avg_num_items.

In [26]:
#Write you code here
avgs =df[["price","num_item"]].mean()
avg_price = avgs["price"]
avg_num_items = avgs["num_item"]
avg_price,avg_num_items

(np.float64(3.1920522110741363), np.float64(1.2983091787439613))

Create a column called "total", which is the product of the price and num_item columns.

In [29]:
#Write your code here
df["total"]= df.price*df.num_item
df.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price,total
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0,2.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0,2.0
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0,6.0
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0,6.0

What is the avgerage price of the three most expensive purchases?

In [51]:
#Write your code here
df_sorted = df.sort_values(by="total", ascenging=False)
#df_sorted.head()
top_three = df_sorted.loc[[4510,4288,3784],"total"]
top_three_mean = top_three.mean()
top_three_mean

TypeError: DataFrame.sort_values() got an unexpected keyword argument 'ascenging'

How many different products are there?

In [36]:
#Write your code here
product_list= df.product_id.unique()
len(product_list)

53

Find the difference between the mean and median of the column total.  Use the describe() method and then index the dataframe it returns.

In [40]:
#Write your code here
df_summary =df.describe()
avg_total= df_summary.loc["mean", "total"]
medium_total = df_summary.loc["50%","total"]
diff= avg_total-medium_total
diff

np.float64(0.9318078781127839)

Use the drop() method to delete the column total from the dataframe df_data.

In [41]:
#Write your code here
df_remove_total = df.drop("total",axis=1)
df_remove_total.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0

Let's dig a little deeper into the data set and answer some basic question.

In [42]:
#Write your code here
df.dtypes

invoice_number    float64
invoice_time       object
store_id           object
product_id          int64
category_id         int64
num_item          float64
price             float64
total             float64
dtype: object

First, covert the column invoice time to a datetime column. Print out the new column types to make sure this was done correctly

In [44]:
#Write your code here
df=pd.read_csv("Purchase_Data.csv",parse_dates=["invoice_time"])
df.dtypes

C:\Users\User\AppData\Local\Temp\ipykernel_8472\2354967477.py:2: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df=pd.read_csv("Purchase_Data.csv",parse_dates=["invoice_time"])

invoice_number           float64
invoice_time      datetime64[ns]
store_id                  object
product_id                 int64
category_id                int64
num_item                 float64
price                    float64
dtype: object

Next, let's create columns called "DOW" and "Month", which store the corresponding weekday and month of the invoice respectively.  Print the head of the dataframe to make sure this was done correctly.

In [47]:
#Write your code here
df["Month"]= df.invoice_time.dt.month
df["DOW"]= df.invoice_time.dt.weekday
df.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price,Month,DOW
0,2.020000e+11,2015-07-15 10:45:00,G816,7000300,210101,1.0,2.0,7,2
1,2.020000e+11,2015-07-15 12:16:00,G816,7070884,70203,1.0,2.0,7,2
2,2.020000e+11,2015-07-15 12:16:00,G816,7070884,70203,1.0,2.0,7,2
3,2.020000e+11,2015-07-15 12:16:00,G816,7070891,70401,1.0,6.0,7,2
4,2.020000e+11,2015-07-15 12:16:00,G816,7090363,70401,1.0,6.0,7,2

Create a variable called num_purchases_wed, which stores the number of purchases made on Wednesday?  You should use value_counts and then index the series it return.

In [48]:
#Write your code here
count_dow= df.DOW.value_counts()
num_purchase_wed = count_dow[3]
num_purchase_wed

np.int64(828)

# Part 3

In this set of practice exercises, we will be working with a demographic data regarding the passengers aboard the Titanic.  Read in the data frame and use the head() method to check that it was read in correctly.

In [91]:
#Write your code here
df= pd.read_csv("Titanic.csv")
df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

Use the rename method to change the column "Name" to "Passenger_Name" and the column "Ticket" to "Ticket_Num".

In [92]:
#Write your code here
df.rename(columns={"Name":"Passenger_Name","Ticket":"Ticket_Num"},inplace=True)
df.head()

,PassengerId,Pclass,Passenger_Name,Sex,Age,SibSp,Parch,Ticket_Num,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

Change the index of the df_titanic to the column PasengerID.

In [93]:
#Write your code here
df.set_index("PassengerId",inplace=True)
df.head()

,Pclass,Passenger_Name,Sex,Age,SibSp,Parch,Ticket_Num,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

Select the name of passenger 896

In [94]:
#Write your code here
df.loc[896,"Passenger_Name"]

'Hirvonen, Mrs. Alexander (Helga E Lindqvist)'

Change the index back to row numbers but making sure that we don't lose the PassengerId column.

In [95]:
#Write your code here
df.reset_index(drop=False,inplace=True)
df.head()

,PassengerId,Pclass,Passenger_Name,Sex,Age,SibSp,Parch,Ticket_Num,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

How many missing entries are there in the Age column? Use the isnull() method and recall than Booleans are exactly like 1s (True) and 0s (False).

In [96]:
#Write you code here
df.isnull().sum()["Age"]

np.int64(86)

Compute the avg age of passengers ignoring the missing data.

In [97]:
#Write your code here
avg_age=df.Age.mean()
avg_age

np.float64(30.272590361445783)

Using the fillna() method replace the missing values in the Age column with the mean.

In [98]:
#Write your code here
df.fillna({"Age":avg_age}, inplace=True)
df.head()

,PassengerId,Pclass,Passenger_Name,Sex,Age,SibSp,Parch,Ticket_Num,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

What is the average age of the 5 oldest passengers? The reset_index method will be helpful here.

In [100]:
#Write your code here
df_sorted =df.sort_values(by='Age',inplace=False,ascending=False)
final_df = df_sorted.reset_index(inplace=False,drop=True)
final_df.loc[0:4,"Age"].mean()

np.float64(67.0)